[{"id":0,"title":"Элегантный JavaScript","author":"Марин Хауэрбеке","image":"https://proglib.io/wp-content/uploads/2017/05/cover.png","price":600,"rating":4,"category":["Frontend"],"description":"Эта книга представляет собой введение в программирование на JS. Книга также охватывает основные парадигмы программирования, например, ООП. В последней части книги рассказывается о Node.js."},{"id":1,"title":"Изучаем паттерны проектирования JavaScript","author":"Эдди Османи","image":"https://proglib.io/wp-content/uploads/2017/05/cover.jpg","price":1000,"rating":5,"category":["Frontend"],"description":"Паттерны проектирования — это традиционные решения типовых задач. Использование хороших паттернов способно улучшить качество, эффективность и безопасность вашего кода, в то время как плохие — так называемые «анти-паттерны» — порождают множество проблем. Эта книга — о JS (и jQuery) паттернах проектирования, техниках и лучших практиках."},{"id":2,"title":"Говорить на JavaScript","author":"Аксель Раушмайер","image":"https://proglib.io/wp-content/uploads/2017/05/orm_front_cover.jpg","price":750,"rating":4,"category":["Frontend","Backend"],"description":"Книга для тех, кто хочет научиться писать код на JS. Автор позволяет себе допущение, что читатель, взявшийся за данную книгу, является программистом, который уже знает хотя бы один объектно-ориентированный или другой язык программирования, такой как PHP, Ruby, Python, C++, Java и так далее."},{"id":3,"title":"Создание клиентских веб-приложений на простом JavaScript","author":"Герд Вагнер","image":"https://proglib.io/wp-content/uploads/2017/05/book-cover-6x9.png","price":1200,"rating":4,"category":["Frontend"],"description":"Эта книга рассчитана на опытных JS-разработчиков, желающих прокачать свой уровень владения языком в контексте разработки полнофункционального веб-приложения."},{"id":4,"title":"Программируем JavaScript-приложения","author":"Эрик Эллиот","image":"https://proglib.io/wp-content/uploads/2017/05/cover-1.jpg","price":2000,"rating":5,"category":["Frontend","Backend"],"description":"Издание, которое научит вас техникам, приемам и лучшим практикам создания современных веб-приложений с использованием JS и связанных веб-технологий вроде JSON и NoSQL."},{"id":5,"title":"PHP 7. Руководство по созданию интерактивных веб-сайтов","author":"Д. Скляр","image":"https://proglib.io/wp-content/uploads/2017/04/978-5-9908462-3-4.jpg","price":2000,"rating":5,"category":["Backend"],"description":"Это новейшее издание адресовано тем, кто только начинает изучать программирование на PHP. Автор раскрывает особенности языка, которые необходимо знать для создания динамических веб-приложений. Вы научитесь работать с веб-серверами, браузерами, базами данных и веб-службами."},{"id":6,"title":"PHP. Объекты, шаблоны и методики программирования","author":"М. Зандстра","image":"https://proglib.io/wp-content/uploads/2017/04/978-5-8459-1922-9.jpg","price":1500,"rating":4,"category":["Backend"],"description":"Книга включает в себя подробный обзор объектно-ориентированных возможностей PHP: определение классов, наследование, инкапсуляция и многое другое. Также вы изучите некоторые основные методы проектирования. Вторая часть книги посвящена шаблонам проектирования, рассмотрены их концепции, методы реализации и применение. В последней части книги описывается несколько важных утилит и методик, помогающих создать успешный проект на основе разрозненных кусков кода. В этой части книги описано, как управлять работой нескольких программистов с помощью Git, как выполнить построение и развертывание проекта с помощью Phing и PEAR. Также вы изучите основы автоматического тестирования и построения проектов."},{"id":7,"title":"PHP 7. Наиболее полное руководство","author":"Д. Котеров, И. Симдянов","image":"https://proglib.io/wp-content/uploads/2017/04/1015313492.jpg","price":1250,"rating":4,"category":["Backend"],"description":"Отражены радикальные изменения в языке PHP, произошедшие с момента выхода предыдущего издания: трейты, пространство имен, анонимные функции, замыкания, элементы строгой типизации, генераторы, встроенный Web-сервер и многие другие возможности. Приведено описание синтаксиса PHP 7, а также функций для работы с массивами, файлами, СУБД MySQL, memcached, регулярными выражениями, графическими примитивами, почтой, сессиями и так далее."},{"id":8,"title":"Внутреннее устройство Linux","author":"Брайан Уорд","image":"https://proglib.io/wp-content/uploads/2018/01/Screenshot_4-6.jpg","price":1500,"rating":5,"category":["Linux"],"description":"Книга, рассказывающая о низкоуровневом функционале Linux, тонкостях работы с системой и системном администрировании в целом. Автор расскажет про устройство ядра Linux, затронет особенности написания системных сценариев на C и вопросы защиты информации, поделится опытом правильного эксплуатирования компьютерных сетей"},{"id":9,"title":"Linux. Установка, настройка, администрирование","author":"Михаэль Кофлер","image":"https://proglib.io/wp-content/uploads/2018/01/1007386752-1.jpg","price":1000,"rating":5,"category":["Linux"],"description":"В семействе Linux существует множество дистрибутивов, каждый из которых чем-то выделяется. Автор постарался рассказать о Linux-системах без привязки к конкретному дистрибутиву. В этой книге речь пойдет о проектах Gnome и KDE, виртуализации, устройстве файловой системы, ядре и его модулях, и еще о множестве вещей, связанных с Linux"},{"id":10,"title":"Командная строка Linux и автоматизация рутинных задач","author":"Колисниченко Денис","image":"https://proglib.io/wp-content/uploads/2018/01/1005470198.jpg","price":750,"rating":4,"category":["Linux"],"description":"Автор рассказывает об основах работы в командной строке Linux и о тонкой настройке системы с помощью утилит, не имеющих графического интерфейса. Подробно разбираются команды Linux, основы файловой системы, рассматривается работа загрузчиков GRUB и GRUB2."},{"id":11,"title":"Linux. Системное программирование","author":"Роберт Лав","image":"https://proglib.io/wp-content/uploads/2018/01/1008879367.jpg","price":1250,"rating":5,"category":["Linux"],"description":"Роберт Лав – автор книг о Linux, одна из ключевых фигур, участвовавших в разработке ядра Linux и среды Gnome. Эта книга может стать настольной для системных программистов: она рассказывает как писать быстрый и умный код, и содержит справочную информацию о системных вызовах. Книга содержит не только теорию, но и практические материалы."},{"id":12,"title":"Программирование микроконтроллерных плат Arduino/Freeduino","author":"Улли Соммер","image":"http://arduinoplus.ru/wp-content/uploads/2016/04/programmirovanie-plat-arduino-freeduino.jpg","price":1500,"rating":4,"category":["Arduino"],"description":"Рассмотрено программирования микро-контроллерных плат Arduino/Freduino Описана структура и функционирование микроконтроллеров, среда программирования Arduino, необходимые инструменты и комплектующие для проведения экспериментов. Подробно рассмотрены основы программирования плат Arduino, структура программы, команды, операторы и функции, аналоговый и цифровой ввод/вывод данных."},{"id":13,"title":"Занимательная электроника","author":"Ревич Юрий","image":"http://arduinoplus.ru/wp-content/uploads/2016/04/zanimatelnaia-elektronika.jpg","price":750,"rating":5,"category":["Arduino"],"description":"На практических примерах рассказано о том, как проектировать, отлаживать и изготавливать электронные устройства в домашних условиях. От физических основ электроники, описания устройства и принципов работы различных радиоэлектронных компонентов, советов по оборудованию домашней лаборатории автор переходит к конкретным аналоговым и цифровым схемам, включая устройства на основе микроконтроллеров."},{"id":14,"title":"Проекты с использованием контроллера Arduino, 2-е издание","author":"Виктор Петин","image":"http://arduinoplus.ru/wp-content/uploads/2016/04/proekti-s-arduino.jpg","price":1200,"rating":4,"category":["Arduino"],"description":"В этой замечательное книге рассмотрены основные платы Arduino и платы расширения (шилды), добавляющие функциональность основной плате. Подробно описан язык и среда программирования Arduino IDE. Тщательно разобраны проекты с использованием контроллеров семейства Arduino. Это проекты и области робототехники, создания погодных метеостанций, 'умного дома', вендинга, телевидения, Интернета, беспроводной связи (bluetooth, радиоуправление)."},{"id":15,"title":"Делаем сенсоры. Проекты сенсорных устройств на базе Arduino и Raspberry Pi","author":"Теро Карвинен, Киммо Карвинен, Вилле Валтокари","image":"http://arduinoplus.ru/wp-content/uploads/2016/04/delaem-sensori.jpg","price":1500,"rating":5,"category":["Arduino"],"description":"В этой потрясающей книге более 440 страниц на которых вы найдете самые интересные и прикладные знания для проектирования 'Умного дома' на Ардуино (Arduino)."},{"id":16,"title":"Ключевые процессы тестирования","author":"Рекс Блэк","image":"https://proglib.io/wp-content/uploads/-000//1/ShowCover.aspx.jpg","price":1500,"rating":5,"category":["Тестирование"],"description":"В этой книге автор описал 12 отдельных процессов тестирования с помощью списка контрольных вопросов. Каждый из процессов очень важен для успешной работы тестировщиков."},{"id":17,"title":"Тестирование. Легкий старт","author":"Константин Азарский","image":"https://proglib.io/wp-content/uploads/-000//1/416xH+RDC8L._SY346_.jpg","price":1220,"rating":4,"category":["Тестирование"],"description":"«Легкий старт» познакомит вас с профессией тестировщика ПО. После прочтения этой книги вы будете иметь практические и теоретические знания, которые позволят вам пройти техническое интервью и работать в области ИТ. Если же вы уже имеете опыт в тестировании, то все равно сможете найти много полезной информации для себя."},{"id":18,"title":"Тестирование программного обеспечения. Базовый курс","author":"Святослав Куликов","image":"https://proglib.io/wp-content/uploads/-000//1/stb_cover.png","price":1500,"rating":4,"category":["Тестирование"],"description":"Основой для книги послужил многолетний опыт проведения семинаров для тестировщиков. Она содержит в себе типичные для начинающих специалистов вопросы и ответы на них. Пособие будет полезно как опытным специалистам, так и тем, кто только делает первые шаги в этой сфере."},{"id":19,"title":"Дневник охотника за ошибками","author":"Тобиас Клейн","image":"https://proglib.io/wp-content/uploads/-000//1/1011986787.jpg","price":2000,"rating":5,"category":["Тестирование"],"description":"В этой книге автор рассказывает, как были обнаружены и использованы ошибки, найденные им в операционной системе Apple iOS, медиа-проигрывателе VLC, веб-браузерах и ядре операционной системы Mac OS X. Она снабжена множеством примеров уязвимого кода и программами, которые использовались для их поиска и проверки."},{"id":20,"title":"Гибкое тестирование. Практическое руководство для тестировщиков ПО и гибких команд","author":"Лиза Криспин, Джанет Грегори","image":"https://proglib.io/wp-content/uploads/-000//1/1001523805.jpg","price":750,"rating":4,"category":["Тестирование"],"description":"По прочтению книги вы будете знать, как использовать квадранты гибкого тестирования, требования к тестировщикам и набор средств, которые поможет сделать тестирование более эффективным. Также здесь описана итерация гибкой разработки и семь главных факторов успеха гибкого тестирования."}]